Revit 2027 API
FabricationService.ServiceId Property
 The service identifier of the service.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int ServiceId { get; }
Public ReadOnly Property ServiceId As Integer
	Get
public:
property int ServiceId {
	int get ();
}
member ServiceId : int with get
Property Value
Int32
See Also
Reference
FabricationService Class
Autodesk.Revit.DB Namespace